Autodesk.Revit.DB.FamilyInstance.GetReferenceName(Autodesk.Revit.DB.Reference)
Gets the name of the reference plane in the family corresponding to the given family instance reference.
Remarks:
If the given family reference corresponds to a named reference plane in the instance's family, the name of that reference plane will be returned.
Otherwise, an empty string will be returned.
reference:
The family instance reference.
Returns:
Returns the name of the reference plane in the family corresponding to the given family instance reference.
If the reference doesn't correspond to a named reference plane, returns an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.FamilyInstance.GetReferenceByName(System.String)
Gets the family instance reference corresponding to the named reference plane in the instance's family.
Remarks:
If there is a reference plane in the instance's family that has the given name, and the plane's "Is Reference" property is not "Not a Reference",
there will be a corresponding reference in the family's instance.  This function returns that reference.
name:
The name of the reference plane in the family.
Returns:
Returns the family instance reference corresponding to the named reference plane in the instance's family.
Returns null if there is no reference plane with this name in the family, or if the plane exists but its "Is Reference" property is "Not a Reference",
or if the input string is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.FamilyInstance.GetReferenceType(Autodesk.Revit.DB.Reference)
Gets the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference.
reference:
The family instance reference.
Returns:
Returns the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference.
Returns FamilyInstanceReferenceType.NotAReference if the instance reference doesn't correspond to a reference plane or line in the family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.FamilyInstance.GetReferences(Autodesk.Revit.DB.FamilyInstanceReferenceType)
Gets family instance references corresponding to the reference planes or reference lines of the given reference type in the instance's family.
referenceType:
The family reference type.
Returns:
Returns all the family instance references corresponding to reference planes and reference lines of the given reference type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.FamilyInstance.UsesInstanceGeometry
Identifies if this FamilyInstance has its own geometry.
Returns: True if this FamilyInstance has the own geometry, false otherwise.
Since: 2018

Autodesk.Revit.DB.FamilyInstance.UseInstanceGeometry
Adds own geometry to a this FamilyInstance.
Remarks:
Using instance geometry means that FamilyInstance has its own geometry that may be different from family. This takes more memory but can be used e.g. to assign instance specific materials to the instance faces.
Since: 2018

Autodesk.Revit.DB.FamilyInstance.GetSweptProfile
Gets the object that describes the profile that is swept along the driving curve for this instance.
Returns: A swept profile.
Since: 2016
Throws Autodesk.Revit.Exceptions.InapplicableDataException: Thrown if this instance does not have a swept profile.

Autodesk.Revit.DB.FamilyInstance.HasSweptProfile
Indicates if this instance can be represented as a swept profile.
Returns: True if the instance can be represented as a swept profile, false otherwise.
Since: 2016

Autodesk.Revit.DB.FamilyInstance.HasModifiedGeometry
Identifies if the geometry of this FamilyInstance
has been modified from the automatically generated default.
Remarks: This method returns true if the geometry has been modified
from post-processing activity in Revit such as joining, cutting,
coping, extension, adaptive component modification, or other similar activity.
Since: 2016

Autodesk.Revit.DB.FamilyInstance.GetSpatialElementFromToCalculationPoints
Gets the locations for the calculation points for this instance.
Returns: A list of 3d points.
Remarks:
For a family instance which connects two rooms or spaces, such as a door or window, the points determine which room or space is considered the "from" and which is considered the "to".
Remarks:
See Autodesk.Revit.DB.FamilyInstance.HasSpatialElementFromToCalculationPoints for reference.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown if this instance does not have from/to calculation points..
Since: 2016

Autodesk.Revit.DB.FamilyInstance.GetSpatialElementCalculationPoint
Gets the location of the calculation point for this instance.
Returns: A 3d point.
Remarks:
See Autodesk.Revit.DB.FamilyInstance.HasSpatialElementCalculationPoint for reference.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown if this instance does not have a single calculation point.
Since: 2016

Autodesk.Revit.DB.FamilyInstance.HasSpatialElementFromToCalculationPoints
Identifies if this instance has a pair of SpatialElementCalculationPoints used as the search points for Revit to identify if the instance lies between up to two rooms or spaces.
Returns: True if this instance has a pair of SpatialElementCalculationPoints used as the search points, false otherwise.
Remarks:
The points determine which room or space is considered the "from" and which is considered the "to" for a family instance which connects two rooms or spaces, such as a door or window.
Since: 2016

Autodesk.Revit.DB.FamilyInstance.HasSpatialElementCalculationPoint
Identifies if this instance has a single SpatialElementCalculationPoint used as the search point for Revit to identify if the instance is inside a room or space.
Returns: True if this instance has a single SpatialElementCalculationPoint used as the search point, false otherwise.
Since: 2016

Autodesk.Revit.DB.FamilyInstance.IsWorkPlaneFlipped
Identifies if the instance's work plane is flipped.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
Work plane cannot be flipped for this instance.

Autodesk.Revit.DB.FamilyInstance.CanFlipWorkPlane
Identifies if the instance can flip its work plane.

Autodesk.Revit.DB.FamilyInstance.GetOriginalGeometry(Autodesk.Revit.DB.Options)
Returns the original geometry of the instance, before the instance is modified by
joins, cuts, coping, extensions, or other post-processing.
Remarks:
This method returns the original geometry of the instance.  The instance's geometry
will reflect the values of all instance level parameters (e.g. reference levels for columns) and
of the placement conditions (so a beam placed along a 20' long line will be 20' long).  It excludes
all modifications made to the geometry due to operations like joining, cutting, openings, coping,
or extensions.
The geometry will not include the GeometryInstance typically returned when you access the geometry
of a FamilyInstance via Element.Geometry.  But GeometryInstances may be encountered if there
are nested family instances within the family.
The geometry is returned in the coordinates of the FamilySymbol, not the coordinates of the
instance.  If needed, you can transform the returned GeometryElement using the GetTransformed()
method, passing the results from GetTransform(), or some other user-defined transformation.
The geometry returned is from Revit's internal computations and does not represent actual
Revit geometry.  Thus, you cannot use it as a reference for other geometry.
options: The options used to obtain the geometry.  Note that ComputeReferences may not
be set to true.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the options are not
valid for this operation (ComputeReferences == true)

Autodesk.Revit.DB.FamilyInstance.IsSlantedColumn
Indicates if the family instance is a slanted column.
Remarks:  If the family instance is a slanted column, it returns true, otherwise returns false.

Autodesk.Revit.DB.FamilyInstance.GetFamilyPointPlacementReferences
Returns the Point Placement References for the Family Instance.
Remarks: If a family instance has point placement references then they are returned by this method,
otherwise an empty collection is returned. Examples of FamilyInstance objects that contain placement
references are Panels and Flexible Components.
Since: 2011

Autodesk.Revit.DB.FamilyInstance.RemoveCoping(Autodesk.Revit.DB.FamilyInstance)
Removes a coping (cut) from a steel beam.
Remarks: This function corresponds to Tools -> Remove coping in Revit Structure.
cutter: A steel beam or column for which this beam currently has a coping cut. May not be null or itself.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when 'cutter' is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when 'cutter' refers to this instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when regeneration fails.

Autodesk.Revit.DB.FamilyInstance.AddCoping(Autodesk.Revit.DB.FamilyInstance)
Adds a coping (cut) to a steel beam.
Remarks: This beam will be cut to fit another element, the cutter. The cut will include an offset
determined by the parameter STRUCTURAL_COPING_DISTANCE. The parameter affects all copings
on this element. This function corresponds to Tools -> Coping in Revit Structure.
cutter: A steel beam or column. May not be null or itself.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when 'cutter' is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when 'cutter' refers to this instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when regeneration fails.

Autodesk.Revit.DB.FamilyInstance.SetCopingIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Specifies the set of coping cutters on this element.
cutters: A set of coping cutters (steel beams and steel columns).
Remarks:  The set may be null or empty, but may not contain the element being coped.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when 'cutters' contains this instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when regeneration fails or if a cutter element is not a FamilyInstance.

Autodesk.Revit.DB.FamilyInstance.GetCopingIds
Lists the elements currently used as coping cutters for this element.
Returns: The coping ElementIds
Lists the elements currently used as coping cutters for this element.

Autodesk.Revit.DB.FamilyInstance.ExtensionUtility
Property to check whether the instance can be extended and return the interface for extension operation.
Remarks: If the family instance can not support extension operation, it returns null

Autodesk.Revit.DB.FamilyInstance.SuperComponent
Property to get the super component of current family instance.
Remarks: When the FamilyInstance has no super component, it returns null

Autodesk.Revit.DB.FamilyInstance.GetSubComponentIds
Gets the sub component ElementIds of the current family instance.
Returns: The subcomponent ElementIDs

Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom
Flips the settings of "From Room" and "To Room" for the door or window instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the FamilyInstance is neither a door nor a window.

Autodesk.Revit.DB.FamilyInstance.ToRoom(Autodesk.Revit.DB.Phase!System.Runtime.CompilerServices.IsByValue)
The "To Room" set for the door or window in the given phase of the project.
Remarks: Revit automatically calculates the "To Room" for a given door or window.  This is the default shown when creating a door or window
schedule and adding the "To Room" properties.  The user can opt to swap the "From Room" and "To Room" values via the schedule if they choose.
The method Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom also can be used to swap the values.
The "To Room" set for the door or window in the given phase of the project.
null if the FamilyInstance is neither a door nor a window, or if the door or window leads to a space
where there is no room (an exterior space or interior space with no room defined).  Also null if there is no
target room assigned to the given phase.
phase: Phase of the project.

Autodesk.Revit.DB.FamilyInstance.ToRoom
The "To Room" set for the door or window.
The "To Room" set for the door or window in the last phase of the project.
Remarks: Revit automatically calculates the "To Room" for a given door or window.  This is the default shown when creating a door or window
schedule and adding the "To Room" properties.  The user can opt to swap the "From Room" and "To Room" values via the schedule if they choose.
The method Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom also can be used to swap the values.
The "To Room" set for the door or window in the last phase of the project.
null if the FamilyInstance is neither a door nor a window, or if the door or window leads to a space
where there is no room (an exterior space or interior space with no room defined).  Also null if there is no
target room assigned to the last phase.

Autodesk.Revit.DB.FamilyInstance.FromRoom(Autodesk.Revit.DB.Phase!System.Runtime.CompilerServices.IsByValue)
The "From Room" set for the door or window in the given phase of the project.
Remarks: Revit automatically calculates the "From Room" for a given door or window.  This is the default shown when creating a door or window
schedule and adding the "From Room" properties.  The user can opt to swap the "From Room" and "To Room" values via the schedule if they choose.
The method Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom also can be used to swap the values.
The "From Room" set for the door or window in the given phase of the project.
null if the FamilyInstance is neither a door nor a window, or if the door or window leads to a space
where there is no room (an exterior space or interior space with no room defined).  Also null if there is no
target room assigned to the given phase.
phase: Phase of the project.

Autodesk.Revit.DB.FamilyInstance.FromRoom
The "From Room" set for the door or window.
The "From Room" set for the door or window in the last phase of the project.
Remarks: Revit automatically calculates the "From Room" for a given door or window.  This is the default shown when creating a door or window
schedule and adding the "From Room" properties.  The user can opt to swap the "From Room" and "To Room" values via the schedule if they choose.
The method Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom also can be used to swap the values.
The "From Room" set for the door or window in the last phase of the project.
null if the FamilyInstance is neither a door nor a window, or if the door or window leads to a space
where there is no room (an exterior space or interior space with no room defined).  Also null if there is no
target room assigned to the last phase.

Autodesk.Revit.DB.FamilyInstance.Split(System.Double)
Splits the family instance element at a point on its defining curve.
Remarks:
Splitting is permitted for architectural and structural columns, beams and braces. Beams and braces that are not a line or an arc is not permitted. See Autodesk.Revit.DB.FamilyInstance.CanSplit to determine if the family instance is allowed to be split by this method.
Splitting modifies this family instance and adds a second family instance to the model.
param: The normalized parameter value along the element (should be greater than 0 and less than 1).
Returns: The newly created family instance id.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when parameter is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the family instance element cannot be split.

Autodesk.Revit.DB.FamilyInstance.CanSplit
Identifies whether a particular family instance can be split at a point on it's defining curve (by Autodesk.Revit.DB.FamilyInstance.Split(System.Double)).
True if the family instance can be split, otherwise false.

Autodesk.Revit.DB.FamilyInstance.rotate
The family instance will be flipped by 180 degrees. If it can not be rotated, return false, otherwise return true.

Autodesk.Revit.DB.FamilyInstance.flipFacing
The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.

Autodesk.Revit.DB.FamilyInstance.flipHand
The orientation of family instance hand will be flipped. If it can not be flipped, return false, otherwise return true.

Autodesk.Revit.DB.FamilyInstance.CanRotate
Property to test whether the family instance can be rotated by 180 degrees.

Autodesk.Revit.DB.FamilyInstance.CanFlipFacing
Property to test whether the orientation of family instance facing can be flipped.

Autodesk.Revit.DB.FamilyInstance.CanFlipHand
Property to test whether the orientation of family instance hand can be flipped.

Autodesk.Revit.DB.FamilyInstance.Mirrored
Property to test whether the family instance is mirrored. (only one axis is flipped)

Autodesk.Revit.DB.FamilyInstance.Invisible
Property to test whether the family instance is invisible.

Autodesk.Revit.DB.FamilyInstance.FacingFlipped
Property to test whether the orientation of family instance facing is flipped.

Autodesk.Revit.DB.FamilyInstance.HandFlipped
Property to test whether the orientation of family instance hand is flipped.

Autodesk.Revit.DB.FamilyInstance.FacingOrientation
Property to get the orientation of family instance facing.

Autodesk.Revit.DB.FamilyInstance.HandOrientation
Property to get the orientation of family instance hand.

Autodesk.Revit.DB.FamilyInstance.HostFace
Property to get the reference to the host face of family instance.
If the instance is placed on a work plane, this property will return the reference to the geometry face underlying the work plane.
If the work plane is not referencing other geometry, this property will return null.
If the instance is not hosted on a face or work plane, this property will return null.

Autodesk.Revit.DB.FamilyInstance.HostParameter
If the instance is hosted by a wall, this property returns the parameter value of the insertion
point of the instance along the wall's location curve, as long as the family of the instance isn't work plane based.
Remarks: This works for instances with a host element that is of type Wall or is in the OST_Walls category only,
including in-place ones.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Only hosted instances whose family is not work plane based can support this functionality.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Only hosted instances of type Wall or in-place elements of category OST_Walls can support this functionality.

Autodesk.Revit.DB.FamilyInstance.Host
If the instance is contained within another element, this property returns the containing
element. An instance that is face hosted will return the element containing the face.
Remarks: An example of an instance that is contained is a window. In this case the host property
would return the wall in which the window is contained. Another example is an instance that is hosted
to a planar or curved face in a Mass element will return the Mass element.

Autodesk.Revit.DB.FamilyInstance.Location
This property is used to find the physical location of an instance within project.
Remarks: The Location property returns an object that can be used to find the location of an instance
within the project. An instance may have a point location, such as a footing or may have a line location.
A beam is an example of an instance that has a line location.

Autodesk.Revit.DB.FamilyInstance.Space(Autodesk.Revit.DB.Phase!System.Runtime.CompilerServices.IsByValue)
The space in which the instance is located in the given phase of the project.
phase: The phase in which to look for a space that contains the instance.
Remarks: This property will be the first space encountered that contains the instance. If more than
one space includes this point in its volume only the first one is returned.
If no space is found that contains the instance, this property is null.

Autodesk.Revit.DB.FamilyInstance.Space
The space in which the instance is located.
The space in which the instance is located (during the last phase of the project).
Remarks: This property will be the first space encountered that contains the instance. If more than
one space includes this point in its volume only the first one is returned.
If no space is found that contains the instance, this property is null.

Autodesk.Revit.DB.FamilyInstance.Room(Autodesk.Revit.DB.Phase!System.Runtime.CompilerServices.IsByValue)
The room in which the instance is located in the given phase of the project.
phase: The phase in which to look for a room that contains the instance.
Remarks: This property will be the first room encountered that contains the instance. If more than
one room includes this point in its volume only the first one is returned.
If no room is found that contains the instance, this property is null.
This property should not be used for door or window instances, which are placed on the boundary or
between rooms.  Use the Autodesk.Revit.DB.FamilyInstance.FromRoom and Autodesk.Revit.DB.FamilyInstance.ToRoom properties instead.

Autodesk.Revit.DB.FamilyInstance.Room
The room in which the instance is located.
The room in which the instance is located (during the last phase of the project).
Remarks: This property will be the first room encountered that contains the instance. If more than
one room includes this point in its volume only the first one is returned.
If no room is found that contains the instance, this property is null.
This property should not be used for door or window instances, which are placed on the boundary or
between rooms.  Use the Autodesk.Revit.DB.FamilyInstance.FromRoom and Autodesk.Revit.DB.FamilyInstance.ToRoom properties instead.

Autodesk.Revit.DB.FamilyInstance.StructuralType
Provides the primary structural type of the instance, such as beam or column etc.

Autodesk.Revit.DB.FamilyInstance.StructuralUsage
Provides the primary structural usage of the instance, such as brace, girder etc.

Autodesk.Revit.DB.FamilyInstance.StructuralMaterialId
Identifies the material that defines the instance's structural analysis properties.

Autodesk.Revit.DB.FamilyInstance.StructuralMaterialType
This property returns the physical material from which the instance is made.
Remarks: Values of this property can be Steel, Concrete, Wood or some other material.
Different from Revit materials that geometry really consists of, this property is a family parameter
defining family behavior and can not be set per instance. Its value is the same with the type of the
instance's family. For example, the instances of different kind of column families(Steel, Concrete or
Wood) have different material values and can't be changed int the UI or RevitAPI.

Autodesk.Revit.DB.FamilyInstance.MEPModel
Retrieves the MEP model for the family instance.
Remarks: If the family instance has a MEP model it is returned by this method, otherwise null is
returned. Different types of MEP model will be returned based on the type of the instance, for
example - if the instance is a lighting device then a lighting device model will be returned.
This property will only function with the Autodesk Revit MEP product.

Autodesk.Revit.DB.FamilyInstance.Symbol
Returns or changes the FamilySymbol object that represents the type of the instance.
Remarks: Setting this property will result in the type of the instance being changed. Related types
can be found by examining the Family to which the symbol belongs.

Autodesk.Revit.DB.FamilyInstance
his object represents a single instance of a family type, such as a single I beam.
Remarks:
Examples of FamilyInstance objects within Autodesk Revit are Beams, Columns,
Braces and Desks. The FamilyInstance object provides more detailed properties that
enable the type of the family instance to be changed, thus changing their appearance
within the project.